In [3]:
import pandas as pd #pandas 임포트
import numpy as np #numpy 임포트

### 판다스 자료구조

### Series

In [5]:
# 시리즈 정의 
obj = pd.Series([4,5,6,-3])
obj

0    4
1    5
2    6
3   -3
dtype: int64

In [7]:
#시리즈 밸류값 확인
obj.values

array([ 4,  5,  6, -3], dtype=int64)

In [8]:
#시리즈 인덱스 확인
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
#시리즈의 앞부분 확인
obj.head()

0    4
1    5
2    6
3   -3
dtype: int64

In [10]:
#시리즈 뒷부분 확인
obj.tail()

0    4
1    5
2    6
3   -3
dtype: int64

In [13]:
#인덱스 바꾸기- 인덱스 0,1,2,3 이 a,b,c,d 됨
obj2 =pd.Series([4,7,5,3], index=['a','b','c','d'])
obj2

a    4
b    7
c    5
d    3
dtype: int64

In [14]:
#파이썬의 딕셔너리 자료형을 시리즈 데이터로 만들기
sdata = {'kim': 100, 'jeon':200, 'lee': 300, 'ma':20}
obj3= pd.Series(sdata)
obj3

kim     100
jeon    200
lee     300
ma       20
dtype: int64

In [16]:
obj3.name = 'salary'
obj3.index.name= 'name'
obj3

name
kim     100
jeon    200
lee     300
ma       20
Name: salary, dtype: int64

In [19]:
#obj3의 인덱스 변경 
obj3.index = ['a','b','c','d']
obj3

a    100
b    200
c    300
d     20
Name: salary, dtype: int64

## 프레임

In [22]:
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [23]:
#인덱스 출력
df.index

RangeIndex(start=0, stop=5, step=1)

In [25]:
#컬럼 출력
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [26]:
#밸류 값 
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [28]:
#각 인덱스 이름 설정하기
df.index.name = 'NO'
df.columns.name = 'info'
df

info     name  year  points
NO
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

In [30]:
#dataFrame 만들면서 columns 와 index 설정가능
df2 = pd.DataFrame(data, columns=['year','name','points','penalty'],
                  index=['one', 'two','three','four','five'])
df2

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [32]:
#밸류형을 불러오고 그것들로 출력할 수 있는 평균, 표준편차, 최소값..등등
df2.describe()

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

### DataFrame indexing

In [33]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
           "year": [2014, 2015, 2016, 2015, 2016],
           "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [34]:
#열 선택
df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [35]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [37]:
df[['year','points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [38]:
df[['year','penalty']]

       year penalty
one    2014     NaN
two    2015     NaN
three  2016     NaN
four   2015     NaN
five   2016     NaN

In [40]:
#새로운 열 추가
df['zeros'] = np.arange(5)
df

       year    names  points penalty  zeros
one    2014    Kilho     1.5     NaN      0
two    2015    Kilho     1.7     NaN      1
three  2016    Kilho     3.6     NaN      2
four   2015  Charles     2.4     NaN      3
five   2016  Charles     2.9     NaN      4

In [43]:
#시리즈 추가
val = pd.Series([1,2,3], index =['two','four','five'])
df['debt']= val
df

       year    names  points penalty  zeros  debt
one    2014    Kilho     1.5     NaN      0   NaN
two    2015    Kilho     1.7     NaN      1   1.0
three  2016    Kilho     3.6     NaN      2   NaN
four   2015  Charles     2.4     NaN      3   2.0
five   2016  Charles     2.9     NaN      4   3.0

In [44]:
#열 삭제
del df['debt']
df

       year    names  points penalty  zeros
one    2014    Kilho     1.5     NaN      0
two    2015    Kilho     1.7     NaN      1
three  2016    Kilho     3.6     NaN      2
four   2015  Charles     2.4     NaN      3
five   2016  Charles     2.9     NaN      4

In [45]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'zeros'], dtype='object')

### 행 선택하고 조작하기

In [46]:
# 0 번째부터 2번째까지 가져온다
df[0:3]

       year  names  points penalty  zeros
one    2014  Kilho     1.5     NaN      0
two    2015  Kilho     1.7     NaN      1
three  2016  Kilho     3.6     NaN      2

In [52]:
#three부터 five까지 , year부터 penalty까지 
# 아래 방법을 권장한다. 
# .loc 또는 .iloc 함수를 사용하는 방법.

df.loc['three':'five','year':'penalty']

         year    names  points penalty
three  2016.0    Kilho     3.6     NaN
four   2015.0  Charles     2.4     NaN
five   2016.0  Charles     2.9     NaN

In [53]:
#새로운 행 삽입
df.loc['six',:] = [2013,'Jun',4.0,0.1,2.1]

df

         year    names  points penalty  zeros
one    2014.0    Kilho     1.5     NaN    0.0
two    2015.0    Kilho     1.7     NaN    1.0
three  2016.0    Kilho     3.6     NaN    2.0
four   2015.0  Charles     2.4     NaN    3.0
five   2016.0  Charles     2.9     NaN    4.0
six    2013.0      Jun     4.0     0.1    2.1

In [54]:
# .iloc 사용:: index 번호를 사용한다.
df.iloc[2] #2번째 행 가져온다

year       2016.0
names       Kilho
points        3.6
penalty       NaN
zeros         2.0
Name: three, dtype: object

In [55]:
df.iloc[3:5, 0:2]

        year    names
four  2015.0  Charles
five  2016.0  Charles

In [56]:
df.iloc[[0,1,3],[1,2]] # iloc() 선택한 행, 열가져오기

        names  points
one     Kilho     1.5
two     Kilho     1.7
four  Charles     2.4

In [57]:
df.iloc[:,1:4]

         names  points penalty
one      Kilho     1.5     NaN
two      Kilho     1.7     NaN
three    Kilho     3.6     NaN
four   Charles     2.4     NaN
five   Charles     2.9     NaN
six        Jun     4.0     0.1

In [59]:
df.iloc[3,1]  #4행 첫번째열

'Charles'

### DataFrame 에서 boolean indexing

In [60]:
df

         year    names  points penalty  zeros
one    2014.0    Kilho     1.5     NaN    0.0
two    2015.0    Kilho     1.7     NaN    1.0
three  2016.0    Kilho     3.6     NaN    2.0
four   2015.0  Charles     2.4     NaN    3.0
five   2016.0  Charles     2.9     NaN    4.0
six    2013.0      Jun     4.0     0.1    2.1

In [62]:
#year가 2014 보다 큰 boolean data
df['year']>2015

one      False
two      False
three     True
four     False
five      True
six      False
Name: year, dtype: bool

In [63]:
df.loc[df['names'] =='Kilho',['names','points']]

       names  points
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [65]:
#새로운 값 대입
df.loc[df['points'] >3 , 'penalty'] = 0
df

         year    names  points penalty  zeros
one    2014.0    Kilho     1.5     NaN    0.0
two    2015.0    Kilho     1.7     NaN    1.0
three  2016.0    Kilho     3.6       0    2.0
four   2015.0  Charles     2.4     NaN    3.0
five   2016.0  Charles     2.9     NaN    4.0
six    2013.0      Jun     4.0       0    2.1